<?php
//if ($params['NEW_VALUE'] == $params['OLD_VALUE'] || strlen($params['NEW_VALUE']) > 6) return;
$ot = $this->description;

if ($params['NEW_VALUE'] > 40) {
   say('Хазяйва! Блін !!! На пристрої - '.$ot.' зараз  '.$params['NEW_VALUE']. ' градусів температура. Можливо треба вимкнути пристрої електричні в будинку, чи перевірити розетку з назвою - ' . $ot, 3);
   registerError('Розетка ' . $ot, 'Хазяйва! Блін !!! На пристрої - '.$ot.' зараз  '.$params['NEW_VALUE']. ' градусів температура. Можливо треба вимкнути пристрої електричні в будинку, чи перевірити розетку з назвою - ' . $ot);
}
